data/ycsb/real-d-run-none-32-4-2024-01-13-13-46-without-append.out
[OVERALL], RunTime(ms), 184131
[OVERALL], Throughput(ops/sec), 5430.91603260722
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 26
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.014120381684778771
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 26
[TOTAL_GC_TIME_%], Time(%), 0.014120381684778771
[READ], Operations, 950038
[READ], AverageLatency(us), 75.47771352303802
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 170879
[READ], 95thPercentileLatency(us), 387
[READ], 99thPercentileLatency(us), 694
[READ], Return=OK, 950038
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1158656.0
[CLEANUP], MinLatency(us), 1158144
[CLEANUP], MaxLatency(us), 1159167
[CLEANUP], 95thPercentileLatency(us), 1159167
[CLEANUP], 99thPercentileLatency(us), 1159167
[INSERT], Operations, 49962
[INSERT], AverageLatency(us), 38.08572515111485
[INSERT], MinLatency(us), 8
[INSERT], MaxLatency(us), 1626
[INSERT], 95thPercentileLatency(us), 84
[INSERT], 99thPercentileLatency(us), 116
[INSERT], Return=OK, 49962