data/ycsb/real-e-load-1102848-32-8-2024-01-13-09-50-with-append.out
[OVERALL], RunTime(ms), 393662
[OVERALL], Throughput(ops/sec), 66591.13655877377
[TOTAL_GCS_G1_Young_Generation], Count, 219
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 339
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.08611448399896358
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 219
[TOTAL_GC_TIME], Time(ms), 339
[TOTAL_GC_TIME_%], Time(%), 0.08611448399896358
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 91168.0
[CLEANUP], MinLatency(us), 91136
[CLEANUP], MaxLatency(us), 91199
[CLEANUP], 95thPercentileLatency(us), 91199
[CLEANUP], 99thPercentileLatency(us), 91199
[INSERT], Operations, 26214400
[INSERT], AverageLatency(us), 13.301275901794433
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 32079
[INSERT], 95thPercentileLatency(us), 20
[INSERT], 99thPercentileLatency(us), 25
[INSERT], Return=OK, 26214400